"USSD_ERROR" = "Chyba pri výkone požiadavky";
"USSD_TERMINATED" = "Sedenie ukončené";

"%@ Call Forwarding\n%@\n%@%@" = "%@ presmerovanie\n%@\n%@%@";
"%@ Call Waiting\n%@" = "%@ čakanie hovorov\n%@";
"%@ Call Barring\n%@\n%@" = "%@ blokovanie hovorov\n%@\n%@";
"%@ Fixed Dialing\n%@" = "%@ fixné vytáčanie\n%@";
"Connected Line Presentation\n%@" = "Prezentácia pripojenej linky\n%@";
"Calling Line Presentation\n%@" = "Prezentácia volanej linky\n%@";
"Connected Line ID Restriction\n%@" = "Obmedzenie ID pripojenej linky\n%@";
"Calling Line ID Restriction\n%@" = "Obmedzenie ID volanej linky\n%@";
"SIM Lock\n%@" = "Zámok SIM\n%@";
"Service Center Address\n%@" = "Adresa servisného centra\n%@";
"Supplementary Service Password\n%@" = "Doplnkové servisné heslo\n%@";
"Calling Name Presentation\n%@" = "Prezentácia volaného mena\n%@";

"Forwards to %@\n" = "Presmeruje na %@\n";

"All Calls" = "Všetky hovory";
"All Conditional Calls" = "Všetky podmienené hovory";
"Async Data Circuit" = "Asynch. dátový obvod";
"Data" = "Dáta";
"Fax" = "Fax";
"Packet Access" = "Packet Access";
"Pad Access" = "Pad Access";
"SMS" = "SMS";
"Sync Data Circuit" = "Synch. dátový obvod";
"Voice" = "Hlas";

"All Outgoing" = "Všetky odchádzajúce";
"All Incoming" = "Všetky prichádzajúce";
"Outgoing International" = "Odchádzajúce medzinárodné";
"Outgoing International, Except Home Country" = "Odchádzajúce medzinárodné, okrem domovskej krajiny";
"Incoming While Roaming Outside Home Country" = "Prichádzajúce použitím roamingu v zahraničí";
"Incoming, Not On SIM" = "Prichádzajúce, nie zo SIM";
"All Services" = "Všetky služby";
"All Outgoing Services" = "Všetky odchádzajúce služby";
"All Incoming Services" = "Všetky prichádzajúce služby";

"Disabled" = "Vypnuté";
"Enabled" = "Zapnuté";

"On All Calls" = "Na všetkých hovoroch";
"When Busy" = "Ak je zaneprázdnený";
"When Unanswered" = "Ak neodpovedá";
"When Unreachable" = "Ak je nedostupný";

"Setting %@ Succeeded" = "Nastavenie %@ úspešné\n";
"Setting Interrogation Succeeded" = "Nastavenie vypočúvania úspešné\n";
"Setting %@ Failed" = "Nastavenie %@ zlyhalo\n";
"Setting Interrogation Failed" = "Nastavenie vypočúvania zlyhalo\n";

"Not Available" = "Nedostupný";
"Network Controlled" = "Sieť kontrolovaná";
"Temporarily Disabled" = "Dočasne vypnuté";
"Temporarily Enabled" = "Dočasne zapnuté";
"Unknown" = "Neznámy";

"Activation" = "Aktivácia";
"Deactivation" = "Deaktivácia";
"Interrogation" = "Vypočúvanie";
"Registration" = "Registrácia";
"Erasure" = "Mazanie";

"No Address" = "Žiadna adresa";
"No Service Specified" = "Služba nešpecifikovaná";
"Type %d" = "Typ %d";

// generic error
"CALL_FAILED" = "Hovor zlyhal";
// error codes
"kCTNoError" = "Žiadna chyba";
"kCTUnknownError" = "Neznáma chyba";
"kCTErrorRadioFailure" = "Zlyhanie rádia";
// Generic network errors
"kCTErrorNetworkFailure" = "Zlyhanie siete";
"kCTErrorCongestion" = "Sieť preťažená";
"kCTErrorUnidentifiedSubscriber" = "Neidentifikovaný odoberateľ";
"kCTErrorFacilityRejected" = "Možnosť zamietnutá";
"kCTErrorUnknownSubscriber" = "Neznámy odoberateľ";
"kCTErrorNetworkOutOfOrder" = "Sieť mimo prevádzky";
"kCTErrorInvalidTransactionIdentifier" = "Neplatný identifikátor transakcie";
"kCTErrorSemanticallyIncorrectMessage" = "Sémanticky nesprávna správa";
"kCTErrorInvalidMandatoryInformation" = "Neplatná povinná informácia";
"kCTErrorMessageTypeNonExistant" = "Typ správy neexistuje";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Správa nie je kompatibilná so stavom protokolu";
"kCTErrorInformationElementNonExistant" = "Prvok informácie neexistuje";
"kCTErrorProtocolErrorUnspecified" = "Chyba protokolu nešpecifikovaná";
"kCTErrorTemporaryFailure" = "Dočasné zlyhanie";
"kCTErrorResourcesUnavailable" = "Zdroje nedostupné";
"kCTErrorRequestedFacilityNotSubscribed" = "Požadovaná služba nie je predplatená";
"kCTErrorRequestedFacilityNotImplemented" = "Požadovaná služba nie je implementovaná";
"kCTErrorInterworkingError" = "Chyba spolupráce";
"kCTErrorInterworkingNotSupported" = "Spolupráca nepodporovaná";
"kCTErrorCommandCannotBeActioned" = "Príkaz nie je možné vykonať";
"kCTErrorNoNetworkService" = "Váš operátor je nedostupný";
// Call related errors
"kCTErrorUnassignedNumber" = "Nepriradené číslo";
"kCTErrorOperatorDeterminedBarring" = "Operátorom určené blokovanie";
"kCTErrorCallBarred" = "Hovor blokovaný";
"kCTErrorUserBusy" = "Obsadené";
"kCTErrorNoUserResponding" = "Nikto neodpovedá";
"kCTErrorNumberChanged" = "Číslo zmenené";
"kCTErrorInvalidNumberFormat" = "Neplatný formát čísla";
"kCTErrorCallRejected" = "Hovor zamietnutý";
// SIM errors
"kCTErrorSimNotInserted" = "SIM karta nie je vložená";
"kCTErrorSimPinRequired" = "PIN pre SIM požadovaný";
"kCTErrorSimPukRequired" = "PUK pre SIM požadovaný";
"kCTErrorSimFailure" = "Zlyhanie SIM";
"kCTErrorSimMemoryFailure" = "Chyba SIM pamäte";
"kCTBadPinFormatError" = "Zlý formát PINu";
"kCTErrorNumberNotAllowed" = "Číslo nie je povolené";
"kCTErrorIncorrectPassword" = "Nesprávne heslo";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Prenos krátkej správy zamietnutý";
"kCTErrorDestinationOutOfOrder" = "Cieľ mimo prevádzku";
"kCTErrorClass0NotSupported" = "Trieda 0 nie je podporovaná";
"kCTErrorCannotReplaceSm" = "SIM sa nedá nahradiť";
"kCTErrorUnspecifiedPid" = "Nešpecifikovaný PID";
"kCTErrorDataCodingSchemeNotSupported" = "Nepodporovaná schéma kódovania dát";
"kCTErrorUnspecifiedDcs" = "Nešpecifikovaná chyba";
"kCTErrorCommandUnsupported" = "Nepodporovaný príkaz";
"kCTErrorUnspecifiedTpCommand" = "Nešpecifikovaná chyba TP príkazu";
"kCTErrorTpduNotSupported" = "TPDU nepodporované";
"kCTErrorScBusy" = "SC zaneprázdnené";
"kCTErrorRejectedBySimSmsControl" = "Odmietnuté kontrolou SIM SMS";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "GPRS neplatné MS";
"kCTErrorGprsIllegalMe" = "GPRS neplatné ME";
"kCTErrorGprsServicesNotAllowed" = "GPRS služby nepovolené";
"kCTErrorGprsPlmnNotAllowed" = "GPRS PLMN nepovolené";
"kCTErrorGprsLocationAreaNotAllowed" = "GPRS oblasť nepovolená";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "GPRS Roaming nepovolený v danej oblasti";
"kCTErrorGprsServiceOptionNotSupported" = "GPRS služba nepodporovaná";
"kCTErrorGprsServiceOptionNotSubscribed" = "GPRS služba nepredplatená";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "GPRS služba dočasne mimo prevádzku";
"kCTErrorGprsPdpAuthenticationFailure" = "Zlyhanie GPRS PDP autentifikácie";
"kCTErrorGprsInvalidMobileClass" = "Neplatná trieda mobilov pre GPRS";
"kCTErrorGprsUnspecified" = "GPRS nešpecifikované";
"kCTErrorGprsMissingorUnknownAPN" = "GPRS chýba neznáme APN";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "Autentifikačné info GBRS PDP odmietnuté základným pásmom";
